app/controllers/articles_controller.rb

    def create
         # @article = Article.new(article_params)
         # @article.save
      @article = Article.new(article_params)
      if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "show"], ["description", "show article desc"], ["created_at", "2016-10-31 20:10:03.978948"], ["updated_at", "2016-10-31 20:10:03.978948"]]