app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page:2)

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "talha"], ["email", "talha@example.com"], ["created_at", "2016-11-02 10:23:46.839689"], ["updated_at", "2016-11-02 10:23:46.839689"]]
---
  def create
    @user = User.new(user_params)
    if @user.save